In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [ ]:
df1= pd.DataFrame(data)

In [ ]:
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada','Pakistan'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003,2021],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2, 3.4]}

In [ ]:
df2 = pd.DataFrame(data)

In [ ]:
df2

      state  year  pop
0      Ohio  2000  1.5
1      Ohio  2001  1.7
2      Ohio  2002  3.6
3    Nevada  2001  2.4
4    Nevada  2002  2.9
5    Nevada  2003  3.2
6  Pakistan  2021  3.4

In [13]:
df2.head(4)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4

In [63]:
excel_data = pd.read_excel('example_excel.xlsx')

In [64]:
excel_data.head()

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

In [65]:
excel_data['Last Name']

0        Abril
1    Hashimoto
2         Gent
3       Hanner
4      Magwood
5        Brumm
6         Hurn
7       Melgar
8      Weiland
Name: Last Name, dtype: object

In [66]:
del excel_data[0]

In [67]:
excel_data

  First Name  Last Name  Gender        Country  Age        Date    Id
0      Dulce      Abril  Female  United States   32  15/10/2017  1562
1       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2     Philip       Gent    Male         France   36  21/05/2015  2587
3   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [68]:
excel_data['First Name']

0       Dulce
1        Mara
2      Philip
3    Kathleen
4     Nereida
5      Gaston
6        Etta
7     Earlean
8    Vincenza
Name: First Name, dtype: object

In [69]:
pd.DataFrame(excel_data)

  First Name  Last Name  Gender        Country  Age        Date    Id
0      Dulce      Abril  Female  United States   32  15/10/2017  1562
1       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2     Philip       Gent    Male         France   36  21/05/2015  2587
3   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [77]:
test_data = pd.DataFrame(excel_data, columns=['Id','First Name',	'Last Name',	'Gender',	'Country',	'Age'	,'Date', 'Adult'])

In [78]:
test_data

     Id First Name  Last Name  Gender        Country  Age        Date  Adult
0  1562      Dulce      Abril  Female  United States   32  15/10/2017    NaN
1  1582       Mara  Hashimoto  Female  Great Britain   25  16/08/2016    NaN
2  2587     Philip       Gent    Male         France   36  21/05/2015    NaN
3  3549   Kathleen     Hanner  Female  United States   25  15/10/2017    NaN
4  2468    Nereida    Magwood  Female  United States   58  16/08/2016    NaN
5  2554     Gaston      Brumm    Male  United States   24  21/05/2015    NaN
6  3598       Etta       Hurn  Female  Great Britain   56  15/10/2017    NaN
7  2456    Earlean     Melgar  Female  United States   27  16/08/2016    NaN
8  6548   Vincenza    Weiland  Female  United States   40  21/05/2015    NaN

In [79]:
test_data['Adult'] = test_data['Age'] > 25

In [91]:
temp_data = test_data[test_data['Country'] == 'United States']

In [92]:
temp_data[temp_data['Gender'] == 'Female']

     Id First Name Last Name  Gender        Country  Age        Date  Adult
0  1562      Dulce     Abril  Female  United States   32  15/10/2017   True
3  3549   Kathleen    Hanner  Female  United States   25  15/10/2017  False
4  2468    Nereida   Magwood  Female  United States   58  16/08/2016   True
7  2456    Earlean    Melgar  Female  United States   27  16/08/2016   True
8  6548   Vincenza   Weiland  Female  United States   40  21/05/2015   True

In [96]:
temp_data

     Id First Name Last Name  Gender        Country  Age        Date  Adult
0  1562      Dulce     Abril  Female  United States   32  15/10/2017   True
3  3549   Kathleen    Hanner  Female  United States   25  15/10/2017  False
4  2468    Nereida   Magwood  Female  United States   58  16/08/2016   True
5  2554     Gaston     Brumm    Male  United States   24  21/05/2015  False
7  2456    Earlean    Melgar  Female  United States   27  16/08/2016   True
8  6548   Vincenza   Weiland  Female  United States   40  21/05/2015   True

In [105]:
temp_data.loc[5]

Id                     2554
First Name           Gaston
Last Name             Brumm
Gender                 Male
Country       United States
Age                      24
Date             21/05/2015
Adult                 False
Name: 5, dtype: object

In [112]:
test_data['City'] = test_data['Country'] == 'United States'

In [114]:
test_data['index_no'] = np.arange(9)

In [115]:
test_data

     Id First Name  Last Name  Gender  ...        Date  Adult   City  index_no
0  1562      Dulce      Abril  Female  ...  15/10/2017   True   True         0
1  1582       Mara  Hashimoto  Female  ...  16/08/2016  False  False         1
2  2587     Philip       Gent    Male  ...  21/05/2015   True  False         2
3  3549   Kathleen     Hanner  Female  ...  15/10/2017  False   True         3
4  2468    Nereida    Magwood  Female  ...  16/08/2016   True   True         4
5  2554     Gaston      Brumm    Male  ...  21/05/2015  False   True         5
6  3598       Etta       Hurn  Female  ...  15/10/2017   True  False         6
7  2456    Earlean     Melgar  Female  ...  16/08/2016   True   True         7
8  6548   Vincenza    Weiland  Female  ...  21/05/2015   True   True         8

[9 rows x 10 columns]

In [116]:
del test_data['City']

In [117]:
del test_data['index_no']

In [118]:
test_data

     Id First Name  Last Name  Gender        Country  Age        Date  Adult
0  1562      Dulce      Abril  Female  United States   32  15/10/2017   True
1  1582       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  False
2  2587     Philip       Gent    Male         France   36  21/05/2015   True
3  3549   Kathleen     Hanner  Female  United States   25  15/10/2017  False
4  2468    Nereida    Magwood  Female  United States   58  16/08/2016   True
5  2554     Gaston      Brumm    Male  United States   24  21/05/2015  False
6  3598       Etta       Hurn  Female  Great Britain   56  15/10/2017   True
7  2456    Earlean     Melgar  Female  United States   27  16/08/2016   True
8  6548   Vincenza    Weiland  Female  United States   40  21/05/2015   True

In [119]:
test_data.T

                        0              1  ...              7              8
Id                   1562           1582  ...           2456           6548
First Name          Dulce           Mara  ...        Earlean       Vincenza
Last Name           Abril      Hashimoto  ...         Melgar        Weiland
Gender             Female         Female  ...         Female         Female
Country     United States  Great Britain  ...  United States  United States
Age                    32             25  ...             27             40
Date           15/10/2017     16/08/2016  ...     16/08/2016     21/05/2015
Adult                True          False  ...           True           True

[8 rows x 9 columns]

In [120]:
test_data

     Id First Name  Last Name  Gender        Country  Age        Date  Adult
0  1562      Dulce      Abril  Female  United States   32  15/10/2017   True
1  1582       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  False
2  2587     Philip       Gent    Male         France   36  21/05/2015   True
3  3549   Kathleen     Hanner  Female  United States   25  15/10/2017  False
4  2468    Nereida    Magwood  Female  United States   58  16/08/2016   True
5  2554     Gaston      Brumm    Male  United States   24  21/05/2015  False
6  3598       Etta       Hurn  Female  Great Britain   56  15/10/2017   True
7  2456    Earlean     Melgar  Female  United States   27  16/08/2016   True
8  6548   Vincenza    Weiland  Female  United States   40  21/05/2015   True

In [128]:
test_data.values[8]

array([6548, 'Vincenza', 'Weiland', 'Female', 'United States', 40,
       '21/05/2015', True], dtype=object)

In [129]:
# Index Objects

In [130]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [131]:
index = obj.index

In [132]:
index

Index(['a', 'b', 'c'], dtype='object')

In [133]:
index['b'] = 'd'

TypeError: ignored

In [134]:
labels = pd.Index(np.arange(3))

In [135]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [136]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [137]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64